Revit 2027 API
GeometryObject.Visibility Property
The visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Visibility Visibility { get; set; }
Public Property Visibility As Visibility
	Get
	Set
public:
property Visibility Visibility {
	Visibility get ();
	void set (Visibility value);
}
member Visibility : Visibility with get, set
Property Value
Visibility
Remarks
The visibility of this object has no effect on the visibility of objects contained within this object. For example, the visibility of a Solid may be Contextual but the faces within that solid may still be Visible.
See Also
Reference
GeometryObject Class
Autodesk.Revit.DB Namespace